traces/03-enumerate.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:addata="http://schemas.microsoft.com/2008/1/ActiveDirectory/Data" xmlns:ad="http://schemas.microsoft.com/2008/1/ActiveDirectory" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<s:Header>
<a:Action s:mustUnderstand="1">http://schemas.xmlsoap.org/ws/2004/09/enumeration/Enumerate</a:Action>
<ad:instance>ldap:389</ad:instance>
<a:MessageID>urn:uuid:51bda933-4fe3-4df8-9bf3-f55d936187de</a:MessageID>
<a:ReplyTo>
<a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
</a:ReplyTo>
<a:To s:mustUnderstand="1">net.tcp://win2016.ad.garming.example.com:9389/ActiveDirectoryWebServices/Windows/Enumeration</a:To>
</s:Header>
<s:Body xmlns:wsen="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:adlq="http://schemas.microsoft.com/2008/1/ActiveDirectory/Dialect/LdapQuery">
<wsen:Enumerate>
<wsen:Filter Dialect="http://schemas.microsoft.com/2008/1/ActiveDirectory/Dialect/LdapQuery">
<adlq:LdapQuery>
<adlq:Filter>(&amp;(objectCategory=crossRef)(systemFlags:1.2.840.113556.1.4.803:=3)(|(nCName=AD)(nETBIOSName=AD)(dnsRoot=AD)))</adlq:Filter>
<adlq:BaseObject>CN=Partitions,CN=Configuration,DC=ad,DC=garming,DC=example,DC=com</adlq:BaseObject>
<adlq:Scope>OneLevel</adlq:Scope>
</adlq:LdapQuery>
</wsen:Filter>
<ad:Selection Dialect="http://schemas.microsoft.com/2008/1/ActiveDirectory/Dialect/XPath-Level-1">
<ad:SelectionProperty>ad:distinguishedName</ad:SelectionProperty>
<ad:SelectionProperty>addata:name</ad:SelectionProperty>
<ad:SelectionProperty>addata:objectClass</ad:SelectionProperty>
<ad:SelectionProperty>addata:objectGUID</ad:SelectionProperty>
<ad:SelectionProperty>addata:nCName</ad:SelectionProperty>
</ad:Selection>
</wsen:Enumerate>
</s:Body>
</s:Envelope>
